homework/hw2/Flat_plate_boundary_layer_distribution/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
  (0 0 0) //0
  (900 0 0)//1
  (900 100 0)//2
  (0 100 0)//3
  (0 0 1)//4
  (900 0 1)//5
  (900 100 1)//6
  (0 100 1)//7
  (300 0 0)//8
  (300 0 1)//9
  (300 100 1)//10
  (300 100 0)//11

);

blocks
(
  hex (0 1 2 3 4 5 6 7) (900 200 1) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
      type patch;
      faces
      (
	(0 4 7 3)
	);

    }
    outlet
    {
      type patch;
      faces
      (
	(1 2 6 5)
	);

    }
    walls
    {
      type wall;
      faces
      (
	(8 1 5 9)
	);
     
    }
    atmosphere
    {
      type patch;
      faces
      (
	(11 10 6 2)
	);
    }
    frontAndBack
    {
      type empty;
      faces
      (
	(0 3 2 1)
	(4 5 6 7)
	);

    }
    symmetryPlanes
    {
      type symmetryPlane;
      faces
      (
	(0 4 9 8)
	(3 7 10 11)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
